// data/loveContent.ts

export const heroContent = {
    title: "Амьдралын минь утга учир хайрт минь чамдаа төрсөн өдрийн мэнд хүргэе ❤️",
    subtitle:
        "Өнөөдөр бол чиний минь хамгийн сайхан өдөр. Энд би чамд хэлмээр байсан бүхнээ үлдээх гэж оролдлоо.",
    buttonLabel: "Доош нь гүйлгээд хайр дүүрэн дурсамжуудыг үзээрэй",
    dateLabel: "Төрсөн өдөр:",
    dateValue: "2025-12-07",
};

export const reasonsToLove = [
    {
        title: "Чиний инээмсэглэл, гоо үзэсгэлэн",
        text: "Өглөө нүдээ нээхэд хамгийн түрүүнд хархыг хүсдэг зүйл минь чи.",
    },
    {
        title: "Чиний дэмжлэг",
        text: "Ямар ч үед намайг ойлгож, дэмжиж надтай хамт зогсдогт чинь би маш их талархдаг.",
    },
    {
        title: "Хайр энэрэл",
        text: "Чиний энэрэнгүй нинжин сэтгэл, ухаалаг байдал, бүтээлч ур чадвар намайг үргэлж гайхашруулж, бишрүүлж байдаг.",
    },
    {
        title: "Чиний халамж",
        text: "Ямарч үед чимээгүйхэн халамжилдаг тэр жижигхэн үйлдлүүд бүгд надад маш их утга учиртай.",
    },
    {
        title: "Гэр бүлээ гэх хайр",
        text: "Биднийг гэх бодол, хайрлаж байгаа чамайг харах бүртээ би дахин дахин дурладаг.",
    },
    {
        title: "Чиний шударга зан",
        text: "Үнэнч, шулуун шударга зан чинь надад маш их итгэл төрүүлдэг.",
    },
    {
        title: "Чиний хүсэл мөрөөдөл",
        text: "Өөртөө, бидэнд зориулсан мөрөөдлүүдээ хэзээ ч орхидоггүй чинь гайхалтай.",
    },
    {
        title: "Онцгой чадвар",
        text: "Энгийн нэгэн өдрийг хүртэл онцгой болгож чаддаг.",
    },
    {
        title: "Чиний сайхан сэтгэл",
        text: "Бусдад тусалж, хайр хуваалцдаг тэр сайхан сэтгэл чинь намайг урамшуулдаг.",
    },
    {
        title: "Зүгээр л ЧАМАЙГ",
        text: "Онцгой шалтгаан хэрэггүй, зүгээр л чамайг байгаа чигээр нь хайрладаг.",
    },
];

export const memoryMoments = [
    {
        date: "2017-09",
        title: "Анхны уулзалт",
        description: "Тэр нэгэн хөөрхөн. өөртөө итгэлтэй ихэмсэг охин гэнэт л миний амьдралд хичээл зүтгэлийг авчирсан",
        // description:
            // "Чамайг анх харсан өдрөөс хойш миний амьдрал өөр болсон. Нүд, инээмсэглэл чинь яг л өчигдөр болсон юм шиг тод санагддаг.",
        image: "/memories/first-date.jpg",
    },
    {
        date: "2018-03",
        title: "Чамдаа дурласан",
        description:
            "Энэ л өдөр чи минь миний зүрхэнд гэрэлтэх болсон. Тэр нэг ягаан цамц",
        image: "/memories/valentines.jpg",
    },
    {
        date: "2019-02-14",
        title: "Анхны Валентины өдөр",
        description:
            "Чамтай хамт өнгөрөөсөн анхны Валентины өдөр миний зүрхэнд хамгийн дулаахан дурсамжуудын нэг.",
        image: "/memories/valentines.jpg",
    },
    {
        date: "2021-09-20",
        title: "Бид хоёрын том шийдвэр",
        description:
            "Амьдралаа хамтдаа үргэлжлүүлье гэж шийдсэн өдөр. Айдас байсан ч чамаар бүрэн дүүрэн тайвширах шиг болсон.",
        image: "/memories/decision.jpg",
    },
    {
        date: "2023-07-10",
        title: "Жижиг аялал, том дурсамж",
        description:
            "Хөдөө явсан аялал дээр гар утсаа мартсан ч, хоорондоо илүү их ярьж инээлдсэн нь хамгийн утгатай нь байлаа.",
        image: "/memories/trip.jpg",
    },
];

export const futureDreams = [
    {
        title: "Илүү олон аялал",
        text: "Бидний очиж үзээгүй улс, хот, үзэсгэлэнт газруудаар хамтдаа очиж үзэн, бид хоёрын болон, гэр бүлийн маш олон гоё шинэ адал явдалууд,дурсамжуудтай болохыг хүсэж байна.",
    },
    {
        title: "Аз жаргалтай, хөгжилтэй өнөр өтгөн гэр бүл",
        text: "Өглөө бүр хамтдаа, өдөр бүр аз жаргалтай, орой бүр инээлдэж, амар тайван орчинд халуун дулаан гэр бүлээрээ өнөр өтгөн урт удаан хамт байх.",
    },
    {
        title: "Хүүхдүүдийнхээ ирээдүйг хамтдаа бүтээх",
        text: "Тэдэндээ үлгэр жишээ сайн эцэг эх байж, хүсэл мөрөөдлөө олоход нь туслалж зөв хүн болгон өсгөх.",
    },
    {
        title: "Чамайг үргэлж инээмсэглүүлж байх",
        text: "Хэдэн жил өнгөрсөн ч, хүнд хэцүү цаг үеүүдийг туулсан ч, өнөөдрийнх шиг нь баярлуулж чаддаг байхыг л хүсэж байна.",
    },
    {
        title: "Зорилго",
        text: "Бие биенийхээ хүсэл зорилгыг сонсож, хамтдаа хичээж урдаа тавьсан зорилгууддаа хэн хэн маань хүрэх",
    },
];
