// data/loveContent.ts

export const heroContent = {
    title: "Амьдралын минь утга учир хайрт минь чамдаа төрсөн өдрийн мэнд хүргэе ❤️",
    subtitle:
        "Өнөөдөр бол чиний минь баярын өдөр. Энд би чамд хэлмээр байсан бүхнээсээ үлдээх гэж оролдлоо.",
    buttonLabel: "Доош нь гүйлгээд хайр дүүрэн дурсамжуудыг үзээрэй",
    dateLabel: "Төрсөн өдөр:",
    dateValue: "2025-12-07",
};

export const reasonsToLove = [
    {
        title: "Чиний инээмсэглэл, гоо үзэсгэлэн",
        text: "Өглөө нүдээ нээхэд хамгийн түрүүнд хархыг хүсдэг зүйл минь чи.",
    },
    {
        title: "Чиний дэмжлэг",
        text: "Ямар ч үед намайг ойлгож, дэмжиж надтай хамт зогсдогт чинь би маш их талархдаг.",
    },
    {
        title: "Хайр энэрэл",
        text: "Чиний энэрэнгүй нинжин сэтгэл, ухаалаг байдал, бүтээлч ур чадвар намайг үргэлж гайхашруулж, бишрүүлж байдаг.",
    },
    {
        title: "Чиний халамж",
        text: "Ямарч үед чимээгүйхэн халамжилдаг тэр жижигхэн үйлдлүүд бүгд надад маш их утга учиртай.",
    },
    {
        title: "Гэр бүлээ гэх хайр",
        text: "Биднийг гэх бодол, хайрлаж байгаа чамайг харах бүртээ би дахин дахин дурладаг.",
    },
    {
        title: "Чиний шударга зан",
        text: "Үнэнч, шулуун шударга зан чинь надад маш их итгэл төрүүлдэг.",
    },
    {
        title: "Чиний хүсэл мөрөөдөл",
        text: "Өөртөө, бидэнд зориулсан мөрөөдлүүдээ хэзээ ч орхидоггүй чинь гайхалтай.",
    },
    {
        title: "Онцгой чадвар",
        text: "Энгийн нэгэн өдрийг хүртэл онцгой болгож чаддаг.",
    },
    {
        title: "Чиний сайхан сэтгэл",
        text: "Бусдад тусалж, хайр хуваалцдаг тэр сайхан сэтгэл чинь намайг урамшуулдаг.",
    },
    {
        title: "Зүгээр л ЧАМАЙГ",
        text: "Онцгой шалтгаан хэрэггүй, зүгээр л чамайг байгаа чигээр нь хайрладаг.",
    },
];

export const memoryMoments = [
    {
        date: "2017-09",
        title: "Анхны уулзалт",
        description: "Тэр нэгэн хөөрхөн. өөртөө итгэлтэй ихэмсэг охин гэнэт л миний амьдралд хичээл зүтгэлийг авчирсан",
        image: "/memories/first-date.JPG",
    },
    {
        date: "2018-03",
        title: "Чамдаа дурласан",
        description:
            "Энэ л өдөр чи минь миний зүрхэнд гэрэлтэх болсон. Тэр нэг ягаан цамц",
        image: "/memories/i-love-you.JPG",
    },
    {
        date: "2019-01-14",
        title: "Бидний хайрын түүх ээхлсэн",
        description:
            "Энэ л өдөр тэр л мөч бидний амьдралыг өөрчилж, хамтдаа бичих гайхалтай хайрын түүхийн эхлэл болсон.",
        image: "/memories/start.JPG",
    },
    {
        date: "2019-02-14",
        title: "Анхны Валентины өдөр",
        description:
            "Чамтай хамт өнгөрөөсөн анхны Валентины өдөр миний зүрхэнд хамгийн дулаахан дурсамжуудын нэг.",
        image: "/memories/valentine.JPG",
    },
    {
        date: "2019-09",
        title: "Бид хоёрын хамгийн том шийдвэр",
        description:
            "Бид амьдралдаа хамтдаа гаргасан мөн бидний анхны хамгийн том бөгөөд хамгийн зөв шийдвэр. Тэр бяцхан зүрх бидний амьдралд аз жаргал, баяр баясал, гэрэл гэгээг улам тод гэрэлтүүлсэн",
        image: "/memories/baby.JPG",
    },
    {
        date: "2020-04-01",
        title: "Энэ бол зөвхөн бидний хайрын өдөр",
        description:
            "Албан ёсоор чи минь миний хайрт эхнэр, би чинийхээ хайрт нөхөр болсон бидний нандин өдөр.",
        image: "/memories/wedding.JPG",
    },
    {
        date: "2020-06-19",
        title: "Бидний гэрэл гэгээ",
        description:
            "Энэ өдөр бид аав ээж гэх эрхэм алдрыг хүртсэн үнэхээр гайхалтай өдөр. Энэ өдөр би үнэхээр их аз жаргалыг мэдэрсэн. Чамдаа маш их баярлалаа",
        image: "/memories/06-19.JPG",
    },
    {
        date: "2022-03-21",
        title: "Бидний анхны том хүсэл зорилго маань биелсэн",
        description:
            "Энэ өдөр бид хамтдаа маш удаан хүсэж мөрөөдөж зорьсон зүйлдээ хүрч чадсан өдөр. Тиймээ бид хамтдаа үүнийг хийж чадсан",
        image: "/memories/bair.jpg",
    },
    {
        date: "2022-04 - 2025-04",
        title: "Аз жаргалтай, гуниг зовлонтой гээд бидний түүх үргэлжилсээр",
        description:
            "Амьдралынхаа баяр хөөр аз жаргалтай мөчүүд мөн алдаа оноотой хүнд хэцүү сорилттой цаг хугацааг бид хамтдаа даван туулж энэ бүх хугацаанд бид аз жаргалтайгаар өөрсдийн амьдралын түүхийг бичсэн мөн цаашид ч маш олон гоё түүхийг бичих болно",
        image: "/memories/bid.jpg",
    },
    {
        date: "2025-04-04",
        title: "Гүнж минь",
        description:
            "Бидний бяцхан гүнж минь бидэндээ ирж бидний амьдралын өнгө, гэрэл гэгээ, баяр баясалыг улам бүр нэмж өдөр бүрийг өөрийнхөө бяцхан зүрхээр гэрэлтүүлж хайр цацруулсан",
        image: "/memories/princess.jpg",
    },
    {
        date: "∞",
        title: "Хязгааргүй",
        description:
            "Бидний түүх маш гайхалтайгаар үргэлжилсээр л байх болно, Энэ бүхнийг бид хамтдаа бүтээж, хамтдаа туулж, хамтдаа зогссоор байх болно. Хайртай шүү",
        image: "/memories/my-family.PNG",
    },
];

export const futureDreams = [
    {
        title: "Илүү олон аялал",
        text: "Бидний очиж үзээгүй улс, хот, үзэсгэлэнт газруудаар хамтдаа очиж үзэн, бид хоёрын болон, гэр бүлийн маш олон гоё шинэ адал явдалууд,дурсамжуудтай болохыг хүсэж байна.",
    },
    {
        title: "Аз жаргалтай, хөгжилтэй өнөр өтгөн гэр бүл",
        text: "Өглөө бүр хамтдаа, өдөр бүр аз жаргалтай, орой бүр инээлдэж, амар тайван орчинд халуун дулаан гэр бүлээрээ өнөр өтгөн урт удаан хамт байх.",
    },
    {
        title: "Хүүхдүүдийнхээ ирээдүйг хамтдаа бүтээх",
        text: "Тэдэндээ үлгэр жишээ сайн эцэг эх байж, хүсэл мөрөөдлөө олоход нь туслалж зөв хүн болгон өсгөх.",
    },
    {
        title: "Чамайг үргэлж инээмсэглүүлж байх",
        text: "Хэдэн жил өнгөрсөн ч, хүнд хэцүү цаг үеүүдийг туулсан ч, өнөөдрийнх шиг нь баярлуулж чаддаг байхыг л хүсэж байна.",
    },
    {
        title: "Зорилго",
        text: "Бие биенийхээ хүсэл зорилгыг сонсож, хамтдаа хичээж урдаа тавьсан зорилгууддаа хэн хэн маань хүрэх",
    },
];
